In [1]:
#4 import the required packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import scipy.stats as stats
import statsmodels.api as sm
%matplotlib inline

In [2]:
#read the fullsmple file

initial = 'data/fullsample.csv'
initial_data = pd.read_csv(initial)

In [3]:
initial_data.shape

(4365379, 12)

In [4]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,247808Mn,115217.12M,14-00:00:00,11-01:32:50,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288Mn,6516.10M,13-18:00:00,12-09:26:41,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288Mn,0.09M,13-18:00:00,13-08:27:36,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288Mn,8333.82M,13-18:00:00,12-03:50:59,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288Mn,8304.03M,13-18:00:00,11-08:43:46,1,1,production,0:0,2019-03-11T10:06:06

In [5]:
initial_data.tail()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
4365374,12741062_145,mickey,boyce,4096Mc,462.90M,00:10:00,00:01:44,1,1,production,0:0,2019-09-25T14:22:03
4365375,12741062_146,mickey,boyce,4096Mc,462.89M,00:10:00,00:01:44,1,1,production,0:0,2019-09-25T14:22:03
4365376,12741062_147,mickey,boyce,4096Mc,553.77M,00:10:00,00:01:53,1,1,production,0:0,2019-09-25T14:22:03
4365377,12741062_148,mickey,boyce,4096Mc,557.09M,00:10:00,00:01:52,1,1,production,0:0,2019-09-25T14:22:03
4365378,12741062_149,mickey,boyce,4096Mc,616.77M,00:10:00,00:01:52,1,1,production,0:0,2019-09-25T14:22:03

In [6]:
initial_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4365379 entries, 0 to 4365378
Data columns (total 12 columns):
JOBID        object
ACCOUNT      object
USER         object
REQMEM       object
USEDMEM      object
REQTIME      object
USEDTIME     object
NODES        int64
CPUS         int64
PARTITION    object
EXITCODE     object
SUBMIT       object
dtypes: int64(2), object(10)
memory usage: 399.7+ MB

In [7]:
initial_data.columns

Index(['JOBID', 'ACCOUNT', 'USER', 'REQMEM', 'USEDMEM', 'REQTIME', 'USEDTIME',
       'NODES', 'CPUS', 'PARTITION', 'EXITCODE', 'SUBMIT'],
      dtype='object')

In [8]:
#remove duplicate rows
initial_data=initial_data.drop_duplicates()

In [9]:
initial_data.shape

(3450799, 12)

In [10]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,247808Mn,115217.12M,14-00:00:00,11-01:32:50,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288Mn,6516.10M,13-18:00:00,12-09:26:41,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288Mn,0.09M,13-18:00:00,13-08:27:36,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288Mn,8333.82M,13-18:00:00,12-03:50:59,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288Mn,8304.03M,13-18:00:00,11-08:43:46,1,1,production,0:0,2019-03-11T10:06:06

In [11]:
#keep only data that has partition= production 
initial_data=initial_data.loc[initial_data['PARTITION']=='production']

In [12]:
initial_data.shape

(3319257, 12)

In [ ]:
#keep only successful jobs. meaning keep all exit code that contain 0:0
#initial_data=initial_data.loc[initial_data['EXITCODE']=='0:0']
#we will use this for qeustions 3 and 4

In [13]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,247808Mn,115217.12M,14-00:00:00,11-01:32:50,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288Mn,6516.10M,13-18:00:00,12-09:26:41,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288Mn,0.09M,13-18:00:00,13-08:27:36,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288Mn,8333.82M,13-18:00:00,12-03:50:59,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288Mn,8304.03M,13-18:00:00,11-08:43:46,1,1,production,0:0,2019-03-11T10:06:06

In [14]:
#remove the - from the reqtime and usedtime
initial_data.REQTIME=initial_data.REQTIME.str.replace('-',':')
initial_data.USEDTIME=initial_data.USEDTIME.str.replace('-',':')

In [15]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,247808Mn,115217.12M,14:00:00:00,11:01:32:50,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288Mn,6516.10M,13:18:00:00,12:09:26:41,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288Mn,0.09M,13:18:00:00,13:08:27:36,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288Mn,8333.82M,13:18:00:00,12:03:50:59,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288Mn,8304.03M,13:18:00:00,11:08:43:46,1,1,production,0:0,2019-03-11T10:06:06

In [16]:
date_time=initial_data.REQTIME

In [17]:
%%time
#covert the REQTIME to total seconds
#initialize the to_secods df outside of the loop
to_seconds=[]
for time in date_time:
    split=time.split(':')
    if len(split)==4:
        seconds=int(split[0])*86400+int(split[1])*3600+int(split[2])*60+int(split[3])
        to_seconds.append(seconds)
    else:
        seconds=int(split[0])*3600+int(split[1])*60+int(split[2])
        to_seconds.append(seconds)

CPU times: user 6.57 s, sys: 121 ms, total: 6.69 s
Wall time: 6.74 s

In [18]:
#now set the results of the loop back in the REQTIME column
initial_data['REQTIME']=to_seconds

In [19]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,247808Mn,115217.12M,1209600,11:01:32:50,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288Mn,6516.10M,1188000,12:09:26:41,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288Mn,0.09M,1188000,13:08:27:36,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288Mn,8333.82M,1188000,12:03:50:59,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288Mn,8304.03M,1188000,11:08:43:46,1,1,production,0:0,2019-03-11T10:06:06

In [20]:
#used_time=initial_data.USEDTIME

In [21]:
#covert the USEDTIME to total seconds
#another way to do seconds conversion. do a function 
def convert_to_seconds(new):
    split_again=new.split(':')
    if len(split_again)==4:
        sec_2=int(split_again[0])*86400+int(split_again[1])*3600+int(split_again[2])*60+int(split_again[3])
        
    else:
        sec_2=int(split_again[0])*3600+int(split_again[1])*60+int(split_again[2])
        
    return sec_2

In [22]:
#my function worked
convert_to_seconds('11:01:32:50')

955970

In [23]:
%%time
#use the fuction created to covert the USEDTIME column to seconds
initial_data.USEDTIME=initial_data.USEDTIME.apply(convert_to_seconds)

CPU times: user 6.17 s, sys: 203 ms, total: 6.38 s
Wall time: 6.19 s

In [24]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,247808Mn,115217.12M,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288Mn,6516.10M,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288Mn,0.09M,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288Mn,8333.82M,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288Mn,8304.03M,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06

In [25]:
#add a space between the value and the units(Mn or Mc)
reqmem=initial_data['REQMEM'].str.replace(r'(Mn|Mc)',r' \1')
#save this back to original to make the changes. 
initial_data.REQMEM=reqmem

In [26]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,247808 Mn,115217.12M,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288 Mn,6516.10M,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288 Mn,0.09M,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288 Mn,8333.82M,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288 Mn,8304.03M,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06

In [27]:
#convert Mn to Mc using a function 
def convert_to_mc(x,y,z):
    num_unit=x.split(' ')
    number=int(num_unit[0])
    unit=num_unit[1]
    if unit=='Mn':
        mc_conversion=(number*y)/(z)
    else:
        mc_conversion=number
        
    return mc_conversion

In [28]:
%%time
initial_data['REQMEM']=initial_data.apply(lambda row: convert_to_mc(row['REQMEM'],row['NODES'],row['CPUS']),axis=1)

CPU times: user 1min 48s, sys: 1.08 s, total: 1min 49s
Wall time: 1min 49s

In [29]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,15488.0,115217.12M,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288.0,6516.10M,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288.0,0.09M,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288.0,8333.82M,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288.0,8304.03M,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06

In [30]:
#add the space between the value and the unit(M)
usedmem=initial_data['USEDMEM'].str.replace(r'(M)',r' \1')
#save this back to the original. now has the space added.
initial_data.USEDMEM=usedmem

In [31]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,15488.0,115217.12 M,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288.0,6516.10 M,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288.0,0.09 M,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288.0,8333.82 M,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288.0,8304.03 M,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06

In [32]:
initial_data.loc[initial_data['CPUS']==0]
#or you can use this 
#initial_data[initial_data['CPUS']==0]

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
1556155,9524253,kumquat,kate,16384.0,16383.34 M,86400,35114,24,0,production,0:0,2019-07-01T14:22:00

In [33]:
#find the index of the row you wanted deleted 
initial_data[initial_data['CPUS']==0].index

Int64Index([1556155], dtype='int64')

In [34]:
#delet the row using the index id of the row you want deleted. 
initial_data.drop(initial_data[initial_data['CPUS']==0].index,inplace=True)
#dfObj.drop( dfObj[ dfObj['Age'] == 30 ].index , inplace=True)

In [35]:
initial_data.shape

(3319256, 12)

In [36]:
initial_data[initial_data['USEDMEM']=='0'].head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
3645,7239987_1,almonds,robt,4096.0,0,1800,20,1,1,production,0:0,2019-03-20T07:31:32
4233,7241024_4,clara,gemma,8192.0,0,7200,6,1,1,production,0:0,2019-03-20T08:32:02
4235,7241024_2,clara,gemma,8192.0,0,7200,5,1,1,production,0:0,2019-03-20T08:32:02
4236,7241024_3,clara,gemma,8192.0,0,7200,4,1,1,production,0:0,2019-03-20T08:32:02
4239,7241033_1,clara,gemma,8192.0,0,7200,32,1,1,production,0:0,2019-03-20T08:33:03

In [37]:
#convert M to Mc using a function 
def m_to_mc(a,b,c):
    if a =='0':
        mc=a
    else:
        split_it=a.split(' ')
        value=float(split_it[0])
        letter=split_it[1]
        mc=(value*b)/(c)
        
    return mc

In [38]:
%%time
initial_data['USEDMEM']=initial_data.apply(lambda row: m_to_mc(row['USEDMEM'],row['NODES'],row['CPUS']),axis=1)

CPU times: user 1min 47s, sys: 1.08 s, total: 1min 49s
Wall time: 1min 49s

In [39]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288.0,6516.1,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06

In [40]:
#exported my clean data to use for other steps
export_clean_data=initial_data.to_csv('data/clean_data.csv',index=None)

In [54]:
array_only_ids=initial_data

In [55]:
def array_jobs(job):
    array_split=job.split('_')
    if len(array_split)==2:
        jobs=job#array_split
    else:
        jobs=0
        
    return jobs

In [56]:
%time
array_only_ids.JOBID=array_only_ids.JOBID.apply(array_jobs)

CPU times: user 4 s, sys: 1e+03 ns, total: 5 s
Wall time: 7.87 s

In [57]:
array_only_ids.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
1,6983193_1880,discovery,serina,12288.0,6516.1,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06
5,7055502_1823,discovery,serina,12288.0,7693.11,1188000,789220,1,1,production,0:0,2019-03-11T10:06:06

In [52]:
array_only_ids.drop(array_only_ids[array_only_ids['JOBID']==0].index,inplace=True)

In [53]:
array_only_ids.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
1,6983193_1880,discovery,serina,12288.0,6516.1,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06
5,7055502_1823,discovery,serina,12288.0,7693.11,1188000,789220,1,1,production,0:0,2019-03-11T10:06:06

In [58]:
array_only_ids.shape

(2575548, 12)

In [59]:
array_only_ids[['number','sub_number']]=array_only_ids.JOBID.str.split('_',expand=True)

In [60]:
array_only_ids.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT,number,sub_number
1,6983193_1880,discovery,serina,12288.0,6516.1,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59,6983193,1880
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06,7055502,1863
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06,7055502,1800
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06,7055502,1806
5,7055502_1823,discovery,serina,12288.0,7693.11,1188000,789220,1,1,production,0:0,2019-03-11T10:06:06,7055502,1823

In [61]:
array_only_ids.shape

(2575548, 14)

In [ ]:
#array_only_ids.number[array_only_ids.USEDTIME<300]

In [62]:
#give me only data with USEDTIME <300 i.e. 5 minutes
array_only_ids=array_only_ids[array_only_ids.USEDTIME<300]

In [63]:
array_only_ids.shape

(696855, 14)

In [65]:
array_of_ids=array_only_ids.groupby(['number','USER','EXITCODE'],as_index=False)[['JOBID']].count()

In [66]:
array_of_ids.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 17488 entries, 0 to 17487
Data columns (total 4 columns):
number      17488 non-null object
USER        17488 non-null object
EXITCODE    17488 non-null object
JOBID       17488 non-null int64
dtypes: int64(1), object(3)
memory usage: 683.1+ KB

In [67]:
#this is the users who commited <500 jobs that were <5 minutes.
array_of_ids.head()

     number    USER EXITCODE  JOBID
0  10000883   boyce      0:0      6
1  10007652  stacey      0:0      1
2  10007726  stacey      0:0      2
3  10007826  gerrit      0:0     50
4  10008050  gerrit      0:0     50

In [69]:
array_of_ids=array_of_ids[array_of_ids.JOBID>500]

In [71]:
array_of_ids.head()

      number      USER EXITCODE  JOBID
30  10021254  demarcus      0:0   6297
54  10081102   lashawn      0:0   1200
64  10094343  demarcus      0:0   6046
65  10100906  demarcus      0:0   7606
66  10100910  demarcus      0:0   7548

In [76]:
#This is the number of times each person committed that criteria
user=array_of_ids.groupby('USER',as_index=False)[['number']].count()

In [77]:
user

        USER  number
0        alf       3
1    alisson       1
2     archie       2
3     baylee       7
4     benson      19
5      boyce      31
6     brande      22
7   demarcus       7
8    hjalmar       2
9   jermaine       1
10      kaye       1
11   lashawn       2
12     macey       1
13      obie       3
14   osborne       1
15   pamelia       1
16     somer       1
17  stefanie       1
18     tegan       2
19    tommie      62
20    vaughn       1
21   whitley       6

In [78]:
user.shape

(22, 2)

In [80]:
#this shows that all these long arrays of short jobs had exitcode of 0:0
#array_of_ids[array_of_ids.EXITCODE=='0:0']

In [81]:
#bring in clean data in new dataframe to work with part 2 of questions one which asks:
#Lots of small jobs submitted together within a 4-hour window,regardless of whether or not they were in an array
er='data/clean_data.csv'
error_code = pd.read_csv(er)

In [82]:
error_code.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288.0,6516.10,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06

In [83]:
#how many jobs were unsuccessful. i.e. exitcode not equal '0:0'
error_code=error_code[error_code.EXITCODE!='0:0']
#array_only_ids=array_only_ids[array_only_ids.USEDTIME<300]

In [84]:
error_code.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
16652,7269184,atemoyas,benson,1024.0,1023.83,1500,1435,1,1,production,0:125,2019-03-21T18:38:42
23910,7281699,pinole,christa,1024.0,430.72,1800,41,2,1,production,7:0,2019-03-22T08:37:35
24000,7281822,pinole,christa,6144.0,0.00,1800,22,1,1,production,7:0,2019-03-22T08:47:42
24274,7282440,blood,jonnie,12288.0,0.18,1800,19,2,1,production,7:0,2019-03-22T09:36:29
24394,7282671,pinole,christa,1024.0,0.16,1800,31,2,1,production,7:0,2019-03-22T10:06:30

In [85]:
error_code.shape

(105, 12)

In [89]:
#shows the accounts and user of each account and how many jobs they committed that failed. 
error_code.groupby(['ACCOUNT','USER'])[['JOBID']].count()

                       JOBID
ACCOUNT     USER
atemoyas    benson         1
baby        christina      1
blood       jonnie         4
carrot      ari            1
cep         tremaine       1
cepuna      luvinia        1
chanterelle adalyn         2
durondeau   ginger         9
forelle     cleva          5
kumquat     icey           5
laxtons     otis          12
melogold    destin        23
milwa       charlotte      1
mixed       tavaris        5
morita      collins        3
pecans      acie           5
            shiela         2
            suzy           4
pinole      christa        5
president   diandra        1
stalk       wava           2
sunburst    belia          8
turban      andra          4

In [ ]:
#error_code.SUBMIT.dt.hour.head()
#error_code.SUBMIT.dt.weekday_name.head()
#error_code.SUBMIT.dt.dayofyear.head()

In [ ]:
#get just the hour out of the SUBMIT column
#error_code['hours']=error_code['SUBMIT'].dt.hour

In [ ]:
#error_code.head()

In [ ]:
#error_code['shifter']=error_code.SUBMIT.shift()

In [ ]:
#error_code.head()

In [ ]:
#diff. in hours
#error_code['diff_hours']=error_code['SUBMIT']-error_code['shifter']
#error_code['diff_hours']=error_code['diff_hours']/np.timedelta64(1,'h')

In [ ]:
#error_code.head()

In [ ]:
#error_code[error_code.diff_hours<= 4]

In [ ]:
#sort by user, the user did jobs within 4 hours, deepcopy

In [152]:
#bring in the clean data again and work on part-2 of question one. Answering the within 4 hours mark
within='data/clean_data.csv'
within_4_hours = pd.read_csv(within)

In [91]:
within_4_hours.shape

(3319256, 12)

In [153]:
within_4_hours.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288.0,6516.10,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06

In [154]:
#converted the submit section to datetime type
within_4_hours['SUBMIT']=pd.to_datetime(within_4_hours.SUBMIT)

In [155]:
within_4_hours.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3319256 entries, 0 to 3319255
Data columns (total 12 columns):
JOBID        object
ACCOUNT      object
USER         object
REQMEM       float64
USEDMEM      float64
REQTIME      int64
USEDTIME     int64
NODES        int64
CPUS         int64
PARTITION    object
EXITCODE     object
SUBMIT       datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(4), object(5)
memory usage: 303.9+ MB

In [156]:
within_4_hours.head(2)

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09 16:38:44
1,6983193_1880,discovery,serina,12288.0,6516.10,1188000,1070801,1,1,production,0:0,2019-03-07 18:39:59

In [157]:
rolling_jobs=within_4_hours[within_4_hours.USEDTIME<300]

In [97]:
rolling_jobs.shape

(822925, 12)

In [158]:
rolling_jobs=rolling_jobs.sort_values('SUBMIT')

In [159]:
#rolling_jobs=within_4_hours.groupby('USER').rolling(on='SUBMIT',window='4H').JOBID.count()
rolling_jobs=rolling_jobs.groupby('USER').rolling(on='SUBMIT',window='4h').JOBID.count()

In [160]:
rolling_jobs.shape

(822925,)

In [161]:
rolling_jobs.head()

USER     SUBMIT
abigail  2019-03-26 15:27:33    1.0
         2019-03-27 03:38:27    1.0
         2019-03-27 11:13:51    1.0
         2019-03-27 11:20:34    2.0
         2019-03-29 11:57:09    1.0
Name: JOBID, dtype: float64

In [162]:
rolling_jobs=rolling_jobs[rolling_jobs>500]

In [163]:
rolling_jobs.head()

USER     SUBMIT
adelina  2019-04-04 14:38:14    501.0
         2019-04-04 14:38:14    502.0
         2019-04-04 14:38:14    503.0
         2019-04-04 14:38:14    504.0
         2019-04-04 14:38:15    505.0
Name: JOBID, dtype: float64

In [104]:
rolling_jobs.shape

(535961,)

In [164]:
#convert rolling jobs to dataframe
rolling_data=pd.DataFrame(rolling_jobs)

In [165]:
#reset the index
#df = df.reset_index(drop=True)
rolling_data=rolling_data.reset_index()

In [166]:
#rename the columns
rolling_data=rolling_data.rename(columns={'JOBID':'JOB_COUNT'})

In [167]:
#this answers the question 1 part 2. the number of users who committed small jobs at short time within 4 hours
rolling_data=rolling_data.groupby('USER')[['JOB_COUNT']].max()

In [168]:
#the highest number of jobs that this user ever submited within a 4 hour period i.e job_count
rolling_data.sort_values(by='JOB_COUNT', ascending=False)#ascending=false does greater to least

          JOB_COUNT
USER
demarcus    23759.0
whitley     21015.0
mikala      13259.0
benson      12287.0
baylee      10729.0
leva         8100.0
boyce        7648.0
brande       7167.0
shiela       6363.0
tommie       4994.0
adelina      3279.0
somer        3245.0
jermaine     2965.0
archie       2468.0
pamelia      2436.0
gemma        2428.0
stacey       2417.0
leaner       2318.0
jones        2285.0
ressie       2118.0
alf          2000.0
osborne      1604.0
lashawn      1487.0
aileen       1484.0
kaye         1343.0
obie         1260.0
hjalmar      1109.0
monna        1047.0
tegan        1036.0
docia         954.0
stanley       947.0
lyman         930.0
milford       920.0
kalen         761.0
jamey         758.0
jabbar        737.0
alisson       733.0
alene         718.0
vaughn        703.0
callie        671.0
tamekia       652.0
stefanie      650.0
macey         643.0
olan          631.0
jayleen       603.0
jolette       519.0
treena        506.0

In [110]:
rolling_data.count()

JOB_COUNT    47
dtype: int64

In [ ]:
# I want the  user that comminted small jobs at short time. whether they were arrays or single jobs/

In [111]:
#bring in the clean data again and work on question 3
percent='data/clean_data.csv'
grp_percent = pd.read_csv(percent)

In [112]:
grp_percent.shape

(3319256, 12)

In [113]:
#keep only successful jobs. meaning keep all exit code that contain 0:0
#initial_data=initial_data.loc[initial_data['EXITCODE']=='0:0']
grp_percent=grp_percent.loc[grp_percent['EXITCODE']=='0:0']

In [114]:
grp_percent=grp_percent.loc[grp_percent['NODES']==1]

In [115]:
grp_percent.shape

(3315147, 12)

In [116]:
grp_percent.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3315147 entries, 0 to 3319255
Data columns (total 12 columns):
JOBID        object
ACCOUNT      object
USER         object
REQMEM       float64
USEDMEM      float64
REQTIME      int64
USEDTIME     int64
NODES        int64
CPUS         int64
PARTITION    object
EXITCODE     object
SUBMIT       object
dtypes: float64(2), int64(4), object(6)
memory usage: 328.8+ MB

In [117]:
grp_percent.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288.0,6516.10,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06

In [118]:
grp_percent.ACCOUNT.nunique()

111

In [ ]:
#converted the submit section to datetime type
#grp_percent['SUBMIT']=pd.to_datetime(grp_percent.SUBMIT)

In [119]:
grp_percent['memory_usage']=((grp_percent.USEDMEM)/(grp_percent.REQMEM))*100

In [120]:
grp_percent.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT,memory_usage
0,6794220,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44,46.494512
1,6983193_1880,discovery,serina,12288.0,6516.10,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59,53.028158
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06,0.000732
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06,67.820801
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06,67.578369

In [121]:
#check one of the users.throw it out!maybe
#remove blood account bc they are using more memory than requried 
grp_percent[grp_percent.ACCOUNT=='blood']

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT,memory_usage
250979,7737740,blood,jonnie,1024.0,516.71,1800,39,1,1,production,0:0,2019-04-12T12:53:42,50.459961
252537,7742321,blood,jonnie,1024.0,3363.05,1800,796,1,1,production,0:0,2019-04-12T14:57:56,328.422852

In [122]:
grp_average=grp_percent.groupby('ACCOUNT',as_index=False)[['memory_usage']].mean()

In [124]:
grp_average

           ACCOUNT  memory_usage
0          alkmene     31.647492
1          almonds     16.996319
2         amaranth      7.814561
3          antares     19.051164
4             arra     43.335769
5         atemoyas      7.472930
6             baby      0.267969
7            basil     10.035680
8              bay      0.247013
9             bell     13.015927
10        bertanne      4.190652
11    blackberries     58.011059
12           blood    189.441406
13      brazilnuts     39.100479
14            bulk      0.740794
15           burro      0.709491
16          carrot      3.335775
17          casaba      7.623542
18          celery     11.399972
19             cep     83.265188
20          cepuna      7.118056
21       champagne      9.713689
22     chanterelle     18.806835
23           clara     31.762624
24           cn121     22.012515
25        cocktail     15.903613
26            crab     54.764132
27          crowns      1.905942
28            dill      1.192334
29       discovery     35.550924
..             ...           ...
81            polk     17.946101
82      portabella      4.731794
83       president     26.688860
84        quelites      0.026077
85           regal      2.642835
86           round      0.982972
87          seeded     21.626290
88        shallots      0.060547
89           shell     59.137694
90           shiny     90.232215
91      sommerfeld     17.190851
92          spring     83.652905
93              st     22.093342
94           stalk      1.693749
95    strawberries     10.697802
96   sugranineteen      0.000000
97          summer      0.300941
98        sunburst      2.096844
99       sunflower      0.000000
100          sweet     14.744273
101          texas      1.963353
102       thomcord      0.870817
103           tree      3.486796
104        treviso     32.365609
105         turban     31.714104
106       virginia     12.359829
107            wax     44.470470
108          white     11.015648
109         winged     49.224391
110           with      1.748389

[111 rows x 2 columns]

In [125]:
grp_average.shape

(111, 2)

In [ ]:
#grp_average[grp_average['memory_usage']>90].groupby('ACCOUNT')['memory_usage'].value_counts()
#grp_percent[grp_percent['memory_usage']>98].groupby(['ACCOUNT','USER'])['memory_usage'].mean()

In [ ]:
#grp_percent=grp_percent[grp_percent['memory_usage']>98]

In [ ]:
#grp_percent.head()

In [ ]:
# What is the sum of durations, for calls only, to each network
#data[data['item'] == 'call'].groupby('network')['duration'].sum()
#grp_percent[grp_percent['memory_usage']>98].groupby(['ACCOUNT','USER'])['memory_usage'].mean()

In [ ]:
#grp_percent.groupby('ACCOUNT')['memory_usage'].mean()

In [126]:
grp_percent.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT,memory_usage
0,6794220,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44,46.494512
1,6983193_1880,discovery,serina,12288.0,6516.10,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59,53.028158
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06,0.000732
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06,67.820801
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06,67.578369

In [144]:
grp_percent['percent_factor']=((grp_percent['USEDTIME'])*(grp_percent['memory_usage']))
#grp_percent['memory_usage']=((grp_percent.USEDMEM)/(grp_percent.REQMEM))*100

In [146]:
grp_percent.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT,memory_usage,percent_factor
0,6794220,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44,46.494512,4.444736e+07
1,6983193_1880,discovery,serina,12288.0,6516.10,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59,53.028158,5.678260e+07
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06,0.000732,8.449629e+02
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06,67.820801,7.125653e+07
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06,67.578369,6.635020e+07